* name 
* gender
* race 
* age 
* phone number 
* dob 
* aadhar 
* email 
* address 
* Fingerprints

In [2]:
import pandas as pd
import random_address
import numpy as np

In [3]:
name_male = pd.read_csv("D:\VIIT\ML\SIH data\SIH_Pyxis\sai\Indian-Male-Names.csv")

In [4]:
name_male.head()

              name gender    race
0          barjraj      m  indian
1     ramdin verma      m  indian
2  sharat chandran      m  indian
3  birender mandal      m  indian
4             amit      m  indian

In [5]:
name_female =  pd.read_csv("D:\VIIT\ML\SIH data\SIH_Pyxis\sai\Indian-Female-Names.csv")

In [6]:
name_female

                            name gender    race
0                        shivani      f  indian
1                           isha      f  indian
2                smt shyani devi      f  indian
3                          divya      f  indian
4                          mansi      f  indian
...                          ...    ...     ...
15377                 saroj devi      f  indian
15378              naina @ geeta      f  indian
15379  manju d/0 baboo lal jatav      f  indian
15380                    shivani      f  indian
15381                      nayna      f  indian

[15382 rows x 3 columns]

In [7]:
nm = name_male[:300]

In [8]:
nf = name_female[:300]

In [9]:
name = pd.concat([nm,nf])

In [10]:
type(name)

pandas.core.frame.DataFrame

In [11]:
name = np.array(name)

In [12]:
name = pd.DataFrame(name,columns=["name","gender","race"])

In [13]:
type(name)

pandas.core.frame.DataFrame

In [14]:
name = name.sample(frac = 1)

In [15]:
name.head()

                 name gender    race
28   punit khandelwal      m  indian
581              neha      f  indian
109      rahul sharma      m  indian
583            tripti      f  indian
330           gulshan      f  indian

In [16]:
add = random_address.real_random_address_by_state("CA")

In [17]:
add

{'address1': '2 Sotelo Avenue',
 'address2': '',
 'city': 'Piedmont',
 'state': 'CA',
 'postalCode': '94611',
 'coordinates': {'lat': 37.820272, 'lng': -122.2195409}}

In [18]:
import random

In [19]:
phno = []

In [20]:
for i in range(600):
    phno.append(random.randint(1000000000,9999999999))

In [21]:
phone_no = np.array(phno)

In [22]:
phone_no = pd.DataFrame(phone_no,columns=["phone_name"])

In [1]:
dob = []

In [2]:
import pandas as pd
import numpy as np
from datetime import date, timedelta
from random import choices
test_date1, test_date2 = date(1922, 1,1 ), date(2022, 1, 1)
K = 600
res_dates = [test_date1]
while test_date1 != test_date2:
    test_date1 += timedelta(days=1)
    res_dates.append(test_date1)
res = choices(res_dates, k=K)
dob.append(res)

In [ ]:
phone_no.head()

In [ ]:
from datetime import datetime

In [ ]:
dob_year = []
dob_month = []
dob_day = []
dob_yr = []

In [ ]:
for i in range(600):

    year = dob[0][i].strftime("%Y")
    month = dob[0][i].strftime("%m")
    day = dob[0][i].strftime("%d")
    dob_yr.append(year)
    dob_month.append(month)
    dob_day.append(day)

In [ ]:
dob_year = np.array(dob_yr)
dob_month = np.array(dob_month)
dob_day = np.array(dob_day)

In [ ]:
dob_year = pd.DataFrame(dob_year,columns=["dob_year"])
dob_month = pd.DataFrame(dob_month,columns=["dob_year"])
dob_day = pd.DataFrame(dob_day,columns=["dob_year"])

In [ ]:
dob_year.head()

In [ ]:
age =[]
for i in dob_yr:
    age.append(int((date.today().year-int(i))))

In [ ]:
type(age[10])

In [ ]:
age = np.array(age)
age = pd.DataFrame(age,columns=["age"])

In [ ]:
age.head()